Easy

In [12]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

df = pd.read_csv("train.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [13]:
df.loc[df['Age'] <= 25, 'Age_group'] = 0 # от 0 до 25 лет
df.loc[(df['Age'] > 25) & (df['Age'] <= 50), 'Age_group'] = 2 #от 25 до 50 лет
df.loc[(df['Age'] > 50), 'Age_group'] = 3 # от 50 лет и старше


# Calculate survival probability for each fare level
age_survival_grouped = df.groupby('Age_group').agg({'Age': ['min', 'max'], 'Survived': ['mean', 'count']}).reset_index()
age_survival_grouped.columns = ['Age_group', 'Age_min' , 'Age_max', 'Survival_proba', 'Count']
age_survival_grouped

   Age_group  Age_min  Age_max  Survival_proba  Count
0        0.0     0.42     25.0        0.411960    301
1        2.0    26.00     50.0        0.412607    349
2        3.0    51.00     80.0        0.343750     64

Hard

In [3]:
import scipy.integrate
from numpy import exp
f= lambda x:exp(-x) #x:exp(-x**2)
i = scipy.integrate.quad(f, 1, 2)
print (i)

(0.23254415793482963, 2.5817587838131664e-15)